servicemix-osgi/http-hbr/result.txt
christian-muellers-macbook-pro:servicemix-osgi cmueller$ ab -n 10000 -c 20 -p 1K_buyStocks.xml -T text/xml http://localhost:8192/service/CBRTransportHeaderProxy
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Jetty(7.4.5.v20110725)
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/CBRTransportHeaderProxy
Document Length:        0 bytes

Concurrency Level:      20
Time taken for tests:   2.986 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      940000 bytes
Total POSTed:           11857760
HTML transferred:       0 bytes
Requests per second:    3349.17 [#/sec] (mean)
Time per request:       5.972 [ms] (mean)
Time per request:       0.299 [ms] (mean, across all concurrent requests)
Transfer rate:          307.44 [Kbytes/sec] received
                        3878.29 kb/s sent
                        4185.73 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.1      1      34
Processing:     0    5   4.5      4      62
Waiting:        0    4   4.0      3      51
Total:          1    6   5.0      5      63

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      6
  80%      6
  90%      8
  95%     11
  98%     24
  99%     34
 100%     63 (longest request)